cf_billing/InformationRegisters/энргТУМКДНаСтруктуреСети.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргТУМКДНаСтруктуреСети</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтруктураСети</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестСтруктураСети</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Строение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргАктивностьТочекУчетаМКД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргАктивностьТочекУчетаМКД</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргСостояниеТочекУчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргТУМКДНаСтруктуреСети/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет схему структуры сети действующих точек.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура ЗаполнитьСхемуСтруктураСетиДействующихТочек(Схема,ПараметрыОтбора,ТаблицаДляПомещения = "") Экспорт 
	
	Если Схема = Неопределено Тогда
		РегистрыСведений.энргАктивностьТочекУчетаМКД.АктивныеТочкиУчета(Схема,ПараметрыОтбора,"ДействующиеТочкиУчета");		
	Иначе
		ЕстьТочкиУчетаПомещения 		= Ложь;
		Для Каждого яПакет Из Схема.ПакетЗапросов Цикл
			Если яПакет.ТаблицаДляПомещения  = "ДействующиеТочкиУчета" Тогда
				ЕстьТочкиУчетаПомещения = Истина;
				Прервать;
			КонецЕсли;		
		КонецЦикла;
		
		Если НЕ ЕстьТочкиУчетаПомещения Тогда
			РегистрыСведений.энргАктивностьТочекУчетаМКД.АктивныеТочкиУчета(Схема,ПараметрыОтбора,"ДействующиеТочкиУчета");		
		КонецЕсли;
	КонецЕсли;
		
	Пакет 								= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));		
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаЗаполнитьСхемуСтруктураСетиДействующихТочек());
	Пакет.ТаблицаДляПомещения 			= ТаблицаДляПомещения;
	ОператорВыбора 						= Пакет.Операторы[0];	
	Источник 							= ОператорВыбора.Источники[0].Источник;
	Параметры 							= Источник.Параметры; 	
	ПараметрПериод 						= Параметры[0];
	
	Если ПараметрыОтбора.Свойство("Период") Тогда
		ПараметрПериод.Выражение 		= Новый ВыражениеСхемыЗапроса(СтрШаблон("&%1",ПараметрыОтбора["Период"].ИмяПараметра));		
	КонецЕсли;
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 				= "Организация, Район, Строение, ТочкаУчета";
		энргФормированиеТекстовЗапроса.УстановитьПараметрыВременнойТаблицыРегистраСведений(Параметры[1],ПараметрыОтбора.ПараметрыВТ,ДоступныеПараметры);				
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаЗаполнитьСхемуСтруктураСетиДействующихТочек()
	
	Текст =
	"ВЫБРАТЬ
	|	энргТУМКДНаСтруктуреСетиСрезПоследних.Организация КАК Организация,
	|	энргТУМКДНаСтруктуреСетиСрезПоследних.Район КАК Район,
	|	энргТУМКДНаСтруктуреСетиСрезПоследних.Строение КАК МКД,
	|	энргТУМКДНаСтруктуреСетиСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	энргТУМКДНаСтруктуреСетиСрезПоследних.СтруктураСети КАК СтруктураСети
	|ИЗ
	|	РегистрСведений.энргТУМКДНаСтруктуреСети.СрезПоследних(
	|			,
	|			(Организация, Район, Строение, ТочкаУчета) В
	|				(ВЫБРАТЬ
	|					ДействующиеТочкиУчета.Организация,
	|					ДействующиеТочкиУчета.Район,
	|					ДействующиеТочкиУчета.МКД,
	|					ДействующиеТочкиУчета.ТочкаУчета
	|				ИЗ
	|					ДействующиеТочкиУчета КАК ДействующиеТочкиУчета)) КАК энргТУМКДНаСтруктуреСетиСрезПоследних";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли
